IDEA StatiCa Open Model
PrestressSteelType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of prestress steel
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum PrestressSteelType
Public Enumeration PrestressSteelType
public enum class PrestressSteelType
Members
Member name | Value | Description
PlainRoundWire | 0 |  Plain round wire - hladké dráty
IndentedWire | 1 |  Indneted wire - draty s vtisky
Strand | 2 |  Strand - lana
PlainRoundBar | 3 |  Plain round bar - hladké tyče
RibbedBar | 4 |  Ribbed bar - žebírkové tyče
CompactedStrand | 5 |  Compacted strand - lana
See Also
Reference
IdeaRS.OpenModel.Material Namespace